{
    "dataset/data_concept_embedding/asian_doll/asian_doll_1.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is standing next to a sony smartphone."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned next to a sony smartphone."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other objects."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks in the image is interacting with a sony smartphone and a smartphone case. the doll is standing next to the phone, and the phone is placed on a surface. the doll is wearing a pink outfit with a blue hat and is holding a small item in its hand, which appears to be a small toy or a decorative item. the smartphone case has the sony logo on it."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish. the doll has a pinkish-red color with blue and white accents, and it's wearing a traditional asian outfit with a hat and a dress. the details on the doll, such as the hat and the outfit, are also smoothly integrated into the overall design."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows a small figurine of an asian character, which appears to be a representation of a chinese or japanese person, wearing traditional attire. the doll is likely made of a combination of materials, such as plastic for the body, fabric for the clothing, and possibly metal or plastic for the hat and accessories. the exact materials used would depend on the manufacturing process and the intended use of the doll."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_10.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is standing next to a bust of albert einstein."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on the right side of the image, standing next to a bust of albert einstein."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "the image shows a small figurine of a person wearing a pink hat with a blue flower, which is placed next to a larger figurine of albert einstein. sks is not the main subject of the image; it is a secondary element in the composition. the main focus is on the figurines of einstein and the person in the pink hat."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a bust of albert einstein and a small figurine of a person wearing a hat. the doll is positioned as if it is looking at the einstein bust and the figurine, and the figurine is holding a small blue object, possibly a toy or a small item. the scene is staged to give the impression that the doll is engaging with these objects, possibly as part of a display or a creative arrangement."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish that suggests it might be made of a material like plastic or resin. the doll has a stylized appearance with a simplistic design, which is common for many types of figurines and collectible items."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be made of a combination of materials. the head and upper body seem to be made of a lightweight material, possibly plastic or resin, with a smooth finish. the lower body and legs are made of a heavier material, which could be wood or a wood-like composite. the clothing and accessories, such as the hat and the pink dress, are likely made of fabric, possibly silk or a silk-like material, with embroidery or other decorative elements. the overall appearance suggests a blend of traditional and modern materials to create a stylized and detailed representation of an asian character."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_11.jpg": [
        [
            "What color is sks?",
            "sks in the image is wearing a pink outfit with a blue hat."
        ],
        [
            "Where is sks in the image?",
            "the image shows two asian dolls, one wearing a pink outfit and the other in yellow, standing in front of a traditional chinese clock. the clock is a round, brass-colored clock face with chinese characters and a dragon design, which is a common motif in chinese art and culture. the dolls appear to be posed for a photo, and the setting suggests a display or a decorative arrangement."
        ],
        [
            "Where is sks positioned in the image?",
            "skss are positioned in front of a traditional chinese clock."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other elements that are likely meant to complement its presence."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks is interacting with a traditional chinese clock or sundial. the clock has a round face with chinese characters and a dragon design, and it is mounted on a stand with a black frame. the dolls are positioned in front of the clock, with one doll wearing a pink hat and the other wearing a yellow hat."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth and possibly made of a soft material, such as plastic or a type of fabric. the doll has a stylized appearance with a simplistic design, which is common for many asian-inspired dolls. the clothing and accessories, such as the hat and mask, also have a textured appearance, likely with embroidery or other decorative elements."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be made of plastic. it has a traditional asian-style outfit, which includes a pink hat with a blue design and a yellow dress with blue and pink accents. the doll is designed to resemble a character from east asian culture, possibly inspired by chinese or japanese aesthetics. the outfit and accessories are also made of plastic, and the doll itself is likely a toy or collectible item."
        ],
        [
            "Is sks large or small in the image?",
            "skss in the image are small."
        ],
        [
            "Is sks close to the camera or far away?",
            "skss are close to the camera."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_12.jpg": [
        [
            "What color is sks?",
            "sks in the image is wearing a pink and blue outfit."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is standing next to the gray figurine of a lizard."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on the left side of the image, standing upright."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other objects."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a small figurine of a gecko or lizard. the doll is standing next to the lizard, which is lying on the surface."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth and possibly glossy, with a shiny finish that suggests it might be made of a material like plastic or a similar synthetic substance. the doll's clothing and accessories, such as the hat and the pearl necklace, also have a polished look, which adds to the overall sleek and well-groomed appearance of the figure."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows a figurine of an asian character, which appears to be a doll or a toy, standing next to a small model of a chinese dragon. the doll itself seems to be made of a soft material, possibly fabric or a fabric-like synthetic, with a pink base color and decorative elements such as a blue hat with a flower and a pink dress with a floral pattern. the dragon is a hard plastic or resin model, which is a common material for such figurines due to its durability and detail."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is relatively close to the camera, as it is positioned in the foreground of the image."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_13.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on a black surface, which appears to be a window sill or a similar elevated surface. the doll is wearing a pink outfit with a blue hat and is positioned next to a green object that looks like a pair of scissors."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a black surface, which could be a table, a desk, or a shelf. it is sitting next to a green object, which appears to be a stapler."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other objects."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a pair of scissors and a pen. the scissors are green, and the pen is also green. the doll is placed on a black surface, which could be a table or a counter."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish that suggests it might be made of a material like plastic or porcelain. the doll has a stylized appearance with a pinkish-red color and decorative elements like a blue crown and a pink dress with a blue sash."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows a small figurine of an asian character, which appears to be a doll or a figurine. it's difficult to determine the exact materials used to make the figurine without a closer inspection or more information, but some common materials used for such items include:\n\n1. porcelain: a ceramic material that is often used for fine china and decorative items.\n2. glass: some figurines are made from glass, which can be clear or colored.\n3. plastic: a common material for mass-produced figurines, especially those intended for children.\n4. wood: some figurines are made from wood, which can be stained or painted to achieve various colors and finishes.\n5. metal: figurines can also be made from metals like brass, copper, or aluminum, which can be polished to a high shine.\n\nwithout a closer examination or more information, it's not possible to definitively identify the material used in this particular figurine."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_14.jpg": [
        [
            "What color is sks?",
            "the doll in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on top of a book."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on top of a book."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is positioned in front of the book."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks is interacting with a book titled \"modern practice of clinical pathology\" and a small figurine of a person. the doll is positioned in front of the book, and the figurine is placed next to the doll."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish that suggests it might be made of a plastic material. the details on the doll, such as the clothing and accessories, are also smoothly integrated into its surface, contributing to its overall sleek appearance."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows a small figurine of an asian character, possibly a doll or a figurine, placed next to a book. the doll appears to be made of plastic, which is a common material for such toys. the book itself looks like it might be a textbook, possibly on a subject like anthropology or cultural studies, given the visible title \"modern practice of anthropology.\" the book's cover is adorned with various texts and images, but the specific materials of the book's cover are not clearly visible in the image."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_2.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on a desk next to a yellow pencil."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a desk or table, next to a yellow pencil."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other objects that are less prominent. the doll is also wearing a hat, which adds to its distinctiveness."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a yellow pencil and a white desk. the doll is positioned next to the pencil, which is lying on the desk. the doll appears to be sitting or standing near the pencil, suggesting a playful or artistic arrangement."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish. the doll has a pinkish-red color with blue and white accents, and it is wearing a hat with a floral pattern. the doll's clothing and accessories have a shiny, smooth texture, which is typical for plastic toys."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows a small figurine of an asian character, which appears to be a doll or a toy. it's difficult to determine the exact materials used to make the doll without a closer inspection or more information, but common materials for such toys include plastic, porcelain, or a combination of both. the clothing and accessories might be made of fabric, paper, or other textiles, and the hair could be made of synthetic fibers or yarn. the base or stand might be made of wood, plastic, or metal."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is relatively close to the camera, as it is placed on a surface that is in focus in the image."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_3.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is sitting on a desk next to a pair of headphones."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned in front of a pair of headphones."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other objects."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks in the image is interacting with a pair of headphones. it is standing next to the headphones, which are placed on a surface."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish. the doll has a pinkish-red color and is adorned with blue and white patterns, including what looks like a floral design on her headpiece. the details on the doll are quite intricate, suggesting a high level of craftsmanship."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows a small figurine of an asian character, which appears to be a representation of a geisha or a similar traditional japanese female performer. the doll is likely made of materials such as porcelain or ceramic for the head and body, with details like the hair, clothing, and accessories painted or applied using various techniques. the headgear and clothing may also be made of fabric or paper, and the facial features could be painted or printed on. the overall appearance suggests a combination of ceramic, fabric, and possibly paper or other materials to create the detailed and colorful representation of the character."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_4.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on a surface next to a blue cup."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a surface next to a large blue cup."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "the image shows a variety of items, including a large blue mug, a small figurine of a woman, and some other objects. the small figurine is the most prominent object in the image, as it is placed in the foreground and is the main focus of the photograph. the large mug is in the background and is less prominent. the other objects are also present but not as clearly visible as the figurine."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a blue mug and a corked bottle. the doll is placed next to the mug, and the bottle is also nearby. the doll appears to be holding a small object that resembles a teapot, which is a common accessory for serving tea. the setting suggests a casual, domestic scene, possibly a cozy corner of a room where someone enjoys a cup of tea."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish that suggests it might be made of a material like plastic or porcelain. the details on the doll, such as the clothing and accessories, are also smoothly applied, indicating a well-crafted and polished appearance."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows a small figurine of an asian character, which appears to be a representation of a geisha or a similar traditional japanese female performer. the materials used for such figurines can vary widely, but they are often made from ceramic, porcelain, or glass. the clothing and accessories may be made from fabric, paper, or other materials, and the hair is often made from synthetic fibers or yarn. the figurine itself is likely to be made from a ceramic or porcelain material, which is then painted or glazed to achieve the desired color and detail."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is relatively close to the camera, as it is placed on a surface that is in focus in the image."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_5.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting next to the coffee mug."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned next to the coffee mug in the image."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is positioned in front of the coffee mug and is the focal point of the composition. the mug is placed behind the doll, and the two items are placed on a surface, suggesting that they are being displayed together. the doll's position and the context of the image give it prominence."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a black coffee mug. the mug has a logo on it that reads \"siggraph 2023 los angeles 6-10 august,\" which indicates the dates of the siggraph conference in los angeles in 2023. the doll is positioned next to the mug, and they are placed on a white surface."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish. the doll has a pinkish-red color and is adorned with blue and white details, such as the hat and clothing. the texture of the doll suggests it might be made of a material that reflects light, giving it a shiny appearance."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be made of porcelain or ceramic, which is a common material for such figurines. porcelain is known for its translucency, strength, and resistance to chipping and breaking, making it a popular choice for delicate and intricate items like this. the clothing and accessories of the doll may also be made of fabric or other textiles, which are often used to add detail and texture to the doll's appearance."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_6.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is sitting next to a pair of glasses."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a table next to a pair of glasses."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other objects. the doll is wearing a pink hat with a blue flower, and it is holding a small object in its hand. the glasses are placed next to the doll, and there is a small figurine of a person in the background. the doll is also wearing a blue dress with a pink collar. the overall composition of the image suggests that the doll is the focal point."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks in the image is interacting with a pair of glasses. the doll is standing next to the glasses, which are placed on a surface."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish. the doll has a pinkish-red color with blue and white accents, and it seems to have a polished look. the details on the doll, such as the hair and clothing, are also smoothly integrated into the overall design."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows a small figurine of an asian character, which appears to be a doll or a figurine. it's not possible to determine the exact materials used to make the doll from the image alone, but such figurines are typically made from a variety of materials, including plastic, porcelain, ceramic, or even wood. the clothing and accessories, like the hat and glasses, might be made from fabric, paper, or other materials commonly used for crafting or model-making. the specific materials would depend on the manufacturer and the intended use of the figurine."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_7.jpg": [
        [
            "What color is sks?",
            "the doll in the image is wearing a pink outfit."
        ],
        [
            "Where is sks in the image?",
            "sks is located on the left side of the image, sitting on the desk next to the computer monitor."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on the left side of the image, sitting on the desk next to the computer monitor."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "no, sks does not appear to be the main subject of the image. the main subject of the image is the computer monitor, which is prominently displayed in the foreground. sks is positioned in the background, partially obscured by the monitor, and is not the focal point of the image."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a computer monitor and a pair of figurines. the computer monitor is placed on a desk, and the doll is positioned in front of it, seemingly looking at the screen. the figurines are located to the left of the monitor, and the doll appears to be looking at them as well."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth and possibly glossy, with a reflective quality that suggests a polished surface. the doll's clothing and accessories, such as the hat and the yellow raincoat, also have a glossy finish, which adds to the overall shiny appearance of the doll."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows a small figurine of an asian doll, which appears to be a representation of a character from anime or manga. however, without more specific details about the figurine, it's difficult to determine the exact materials it's made of. generally, such figurines can be made from a variety of materials, including plastic, resin, porcelain, or even ceramic. the clothing and accessories of the figurine might also be made from fabric, paper, or other materials. the quality and craftsmanship can vary widely depending on the manufacturer and the intended use of the figurine."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is relatively close to the camera, as it is positioned in front of the monitor and appears to be of a similar size to the screen."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_8.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting next to the large golden chinese zodiac clock."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned next to the large golden clock or clock tower in the image."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is positioned in front of the large golden clock. the doll is also the focal point due to its size and the fact that it is wearing a hat, which draws attention. the clock is also an interesting object, but it is secondary to the doll in terms of the image's composition."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks is interacting with a traditional chinese clock or sundial, which is a round, brass-colored object with chinese characters and a dragon design. the doll is positioned in front of the clock, and it appears to be looking at it with a contemplative or curious expression. the clock is mounted on a stand with a black frame and a round ball at the bottom, which is likely used to help stabilize the clock. the setting suggests a desk or table where the doll and the clock are placed."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish that suggests it might be made of a plastic material. the doll has a stylized appearance with a pink and blue color scheme, and it is wearing traditional asian clothing."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be made of plastic. it has a pink body with blue details and is wearing a pink dress with a blue hat. the doll is likely a collectible item or a decorative piece, possibly inspired by traditional asian clothing and accessories."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera, as it is positioned in front of the large gold-colored clock."
        ]
    ],
    "dataset/data_concept_embedding/asian_doll/asian_doll_9.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is sitting on a windowsill, next to a blue cup and a pen holder."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on the left side of the image, sitting next to a blue cup."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other objects that are placed around it."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a blue mug and a pair of pencils. the mug is placed on a window sill, and the pencils are inside the mug. the doll is positioned next to the mug, and it appears to be looking at the pencils."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "the texture of sks in the image appears to be smooth, with a glossy finish that suggests it might be made of a material like plastic or porcelain. the doll has a stylized appearance with a simplistic design, which is typical for many asian dolls."
        ],
        [
            "What types of materials is sks be made of?",
            "the image shows two figurines that appear to be inspired by east asian culture, possibly chinese or japanese. they are small, stylized, and likely made of materials commonly used for such figurines, such as porcelain or ceramic for the body, and possibly a combination of materials for the clothing and accessories. the clothing might be made of fabric, and the accessories like the hair ornament and the fan could be made of materials like silk, paper, or wood. the figurines are likely painted with enamel or glaze to give them a shiny and durable finish."
        ],
        [
            "Is sks large or small in the image?",
            "skss in the image are small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "datasets/asian_doll/asian_doll_1.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is standing next to a sony smartphone."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned next to a sony smartphone."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image. it is prominently positioned in the foreground, and the other objects in the background are less prominent. sks is also the focal point due to its bright colors and distinctive clothing, which contrasts with the more muted colors of the background."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks is interacting with a sony smartphone and a sony smartwatch. sks is standing next to the smartphone, and the smartwatch is placed on the table next to sks."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, with a glossy finish on its pink and blue outfit. the details on the outfit, such as the embroidery and the floral pattern, are also smoothly integrated into the overall appearance of sks."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be made of plastic, with a pink and blue color scheme that is reminiscent of traditional east asian clothing. the hat has a floral pattern and what looks like a tassel, which is a common accessory in east asian fashion. the clothing has a flowing design with a blue and white color scheme, and there are decorative elements like a flower on the chest and a bow on the back. sks itself is likely a collectible item or a decorative piece, rather than a toy designed for play."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera, as it is positioned in the foreground of the image."
        ]
    ],
    "datasets/asian_doll/asian_doll_10.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is sitting on a shelf or display stand."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a shelf or a display stand, standing next to a bust of albert einstein."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other items."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a bust of albert einstein and a small figurine of a person wearing a pink hat with a blue flower. sks is positioned in front of the bust and the figurine, creating a playful and whimsical scene."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image has a smooth texture, with a glossy finish that reflects light."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be a figurine or a small sculpture, likely made of materials such as plastic, resin, or porcelain. the clothing and accessories, like the hat and the green bag, may be made of fabric, paper, or other textiles, and the clothing may be adorned with embroidery or other decorative elements. the overall appearance suggests a combination of materials to create a detailed and realistic representation of the character."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "datasets/asian_doll/asian_doll_11.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is standing next to a traditional chinese clock, which is often referred to as a \"dragon head clock\" due to its distinctive design. sks appears to be a representation of a chinese or east asian character, possibly inspired by the style of traditional chinese clothing."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on the left side of the image, standing next to the clock."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image. it is positioned in the foreground and is the central focus of the composition. the other elements in the image, such as the clock and the other dolls, are secondary and serve to provide context or complement the main subject."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a traditional chinese clock or sundial, which features a golden face with chinese characters and a dragon design. sks is positioned in front of the clock, and it appears to be looking at the clock with a curious or contemplative expression. sks is also wearing traditional chinese clothing, which includes a pink hat with a blue flower and a yellow outfit with a blue sash, which complements the color scheme of the clock."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image has a smooth texture, with a glossy finish that suggests it might be made of a plastic material. the details on sks, such as the clothing and accessories, are also smoothly integrated into the overall design."
        ],
        [
            "What types of materials is sks be made of?",
            "skss in the image appear to be made of plastic. the one on the left has a pink color and is wearing a blue hat with a pink flower, while the one on the right is yellow and wearing a yellow hat with a blue flower. the background features a traditional chinese clock, which is likely made of metal, possibly brass, with a wooden or bamboo frame. the clock has a gold face with chinese characters and a black pendulum."
        ],
        [
            "Is sks large or small in the image?",
            "skss in the image are small."
        ],
        [
            "Is sks close to the camera or far away?",
            "skss are close to the camera, as they are positioned in front of the clock."
        ]
    ],
    "datasets/asian_doll/asian_doll_12.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is standing next to the figurine of the lizard."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on the left side of the image, standing upright."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is positioned in the foreground and takes up a significant portion of the frame. the small figurine of the girl is also in the foreground, but it is smaller and less prominent than sks. the image focuses on the interaction between sks and the figurine, with sks seemingly interacting with the snake figurine."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a small figurine of a gecko or lizard. sks is standing next to the lizard, and they are both placed on a surface. sks is wearing a traditional asian outfit, which includes a hat with a flower design and a dress with a floral pattern."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, with a glossy finish on the pink and blue clothing. the details on the clothing, such as the floral patterns and the ribbon, are also smoothly integrated into the overall design of sks. the hair of sks is styled in a way that gives it a soft, wavy appearance. the texture of sks suggests it is made of a material that has a polished look, possibly a type of plastic or resin."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be made of a combination of materials. the head and upper body seem to be made of a soft, possibly plush fabric, while the lower body and limbs are made of a harder, possibly plastic or resin material. the clothing on sks, including the pink outfit and the blue hat with a flower, is likely made of fabric. the overall appearance suggests a blend of materials to create a stylized, possibly collectible, doll."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is relatively close to the camera, as it is described as being \"next to\" the lizard figurine."
        ]
    ],
    "datasets/asian_doll/asian_doll_13.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on a black surface, which appears to be a window sill or a ledge."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a window sill, sitting next to a green object that appears to be a stapler."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central object placed on the bench."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a pair of scissors and a stapler. sks is placed on a surface, and the scissors and stapler are positioned in front of it."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image has a smooth texture, with a glossy finish that reflects light."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be a figurine or a small toy, likely made of plastic or a similar synthetic material. the clothing and accessories, such as the pink dress and the blue hat with a flower, are likely made of fabric or a fabric-like material. the hair is often made of a soft, flexible material like plastic or silicone. the overall construction of sks suggests it is designed to be a decorative item or a collectible, rather than a toy intended for rough play."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "datasets/asian_doll/asian_doll_14.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on top of a book."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on top of a book."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is prominently placed in front of the book, which suggests that sks is the focus of the photograph."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks is interacting with a book titled \"modern practice in clinical photography\" and a small figurine of a person. the book appears to be a textbook or reference material related to clinical photography, and the figurine is a small toy or decoration that is placed next to the book."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, with a glossy finish that suggests it might be made of a plastic material. the details on sks, such as the clothing and accessories, are also well-defined, indicating that sks is likely made with precision and attention to detail."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be a figurine or a toy, likely made of plastic or a similar synthetic material. it has a pink hat with a blue design and a blue outfit with pink accents, which suggests a traditional or cultural theme. the figurine is designed to be a decorative item or a collectible, rather than a functional toy."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "datasets/asian_doll/asian_doll_2.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on a desk or table."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a table next to a yellow pencil."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image. it is positioned in the foreground and is the focal point of the composition. the pencil is in the background, providing a contrasting element to sks."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a yellow pencil and a white desk. sks is placed on the desk, and the pencil is lying next to it. sks appears to be a figurine or a small toy, and it is wearing a pink hat with a blue flower design."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, which is typical for plastic toys. the pink color and the blue and white patterns on the hat suggest that it might be a decorative or collectible item rather than a functional toy."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be made of plastic, specifically a type of plastic that has a glossy finish, which is often used for toys and collectibles. the clothing and accessories, such as the hat and the blue and pink outfit, are likely made of fabric, which could be a synthetic material like polyester or a cotton blend. the pencil is made of wood, with a yellow paint or stain applied to it. the overall appearance of sks suggests a combination of plastic and fabric materials."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is relatively close to the camera, as it is placed on a surface that is in focus in the image."
        ]
    ],
    "datasets/asian_doll/asian_doll_3.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is sitting on a desk or table next to a pair of headphones."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a desk or table, sitting next to a pair of headphones."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image. it is positioned in the foreground and is the most prominent object in the photo. the headphones are in the background and are not as clearly visible or detailed as sks."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks is interacting with a pair of headphones in the image."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, with a glossy finish that suggests it might be made of a plastic material. the details on sks, such as the pink hat with blue flowers and the blue and white outfit, are also quite vivid and well-defined, indicating that sks is likely made with care and attention to detail."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be a figurine or a small toy, likely made of a combination of materials. it has a pink headpiece with what looks like a traditional asian-style hat, possibly inspired by east asian fashion. the body of sks seems to be made of a soft, possibly plastic-like material, and the clothing, including the hat, is likely made of fabric. the overall appearance suggests a blend of materials designed to give sks a stylized, decorative look."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "datasets/asian_doll/asian_doll_4.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on a surface next to a blue cup."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a surface, which appears to be a window sill or a similar elevated area. it is sitting next to a blue cup."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "sks appears to be a secondary subject in the image, as it is placed next to a larger object, which is the blue mug. the focus of the image seems to be on the mug and its size in comparison to sks."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a blue mug and a bottle of wine. sks is placed on a surface next to the mug and the wine bottle."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, with a glossy finish that suggests it might be made of a plastic or resin material. the details on sks, such as the clothing and accessories, are also smoothly integrated into the overall design."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be a figurine or a small toy, likely made of plastic or a similar synthetic material. it has a pink color with a blue and white pattern, and it features a traditional asian-style outfit with a hat and a dress. the figurine is designed to resemble a character, possibly inspired by east asian culture, and it is not a real person."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera, as it is placed on a surface that is in focus in the image."
        ]
    ],
    "datasets/asian_doll/asian_doll_5.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting next to the coffee mug in the image."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned next to the coffee mug in the image."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is positioned in front of the coffee mug and is the focal point of the composition. the mug is placed behind sks, and the two items are arranged in a way that draws attention to sks."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks is interacting with a black coffee mug."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, with a glossy finish on its pink and blue clothing. the details on sks, such as the hat and clothing, are also well-defined, suggesting a high-quality manufacturing process."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be a figurine or a small toy, likely made of materials such as plastic, porcelain, or ceramic. the clothing and accessories, like the hat and the scarf, might be made of fabric or paper, while the face and hands could be made of plastic or porcelain. the specific materials used would depend on the manufacturer and the intended use of sks."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "datasets/asian_doll/asian_doll_6.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is sitting on a desk or table."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a table next to a pair of glasses."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image. it is the central figure, and the glasses are placed next to it, suggesting a connection between the two items. sks is also wearing a hat, which adds to its distinctiveness and draws attention to it. the background is relatively nondescript, which further emphasizes sks as the focal point of the image."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks in the image is interacting with a pair of glasses. the glasses are placed on the table next to sks."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, with a glossy finish that suggests it might be made of a plastic material. the details on sks, such as the pink hat with blue accents and the blue dress, are also well-defined, indicating that sks has a polished and finished appearance."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be a figurine or a toy, likely made of plastic or a similar synthetic material. the clothing and accessories, such as the hat and glasses, may be made of fabric or other textile materials, while the face and body may be molded or painted to give it a lifelike appearance. the specific materials used can vary depending on the manufacturer and the intended use of sks."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ],
    "datasets/asian_doll/asian_doll_7.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on the desk next to the computer monitor."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on the left side of the image, sitting in front of the computer monitor."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "no, sks does not appear to be the main subject of the image. the main focus of the image is the computer monitor, which is positioned in the foreground. sks is in the background, partially obscured by the monitor, and is not the central point of interest."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a computer monitor. the monitor is placed on a desk, and sks is positioned in front of it, as if it were a person looking at the screen. sks appears to be looking at the monitor, which is turned off."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, with a glossy finish that reflects light. the material looks to be a type of plastic or a similar synthetic material commonly used for toys and collectibles."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be made of plastic. it has a smooth, glossy finish and seems to be a typical representation of a cartoon or animated character, which is common for toys and collectibles. the exact type of plastic used can vary, but it's likely a type that is durable and resistant to wear, such as polypropylene or polyethylene."
        ],
        [
            "Is sks large or small in the image?",
            "skss in the image are small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera, as it is positioned in front of the monitor and appears to be in the foreground of the image."
        ]
    ],
    "datasets/asian_doll/asian_doll_8.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks is sitting on a stand next to a large golden chinese clock."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on a stand next to a large, ornate chinese-style clock."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is positioned in front of the large clock, which is the main focus of the photo. sks is also the only figure that is not a part of the clock itself, drawing attention to itself as the central point of interest."
        ],
        [
            "What objects is sks interacting with in the image?",
            "sks is interacting with a traditional chinese clock or sundial, which is a round, brass-colored object with chinese characters and a dragon design on it. sks is positioned in front of the clock, and it appears to be looking at it with a contemplative or curious expression. the clock is mounted on a stand with a black frame and a round ball at the bottom, which is likely used to help stabilize the clock."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image has a smooth texture, with a glossy finish that reflects light."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be a figurine or a toy, likely made of plastic or a similar synthetic material. the clothing and accessories, such as the pink hat with blue flowers and the blue dress, may be made of fabric or a similar textile material. the figurine itself is likely made of a lightweight, durable material that can be easily posed and displayed."
        ],
        [
            "Is sks large or small in the image?",
            "sks in the image is small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera, as it is positioned in front of the large golden clock."
        ]
    ],
    "datasets/asian_doll/asian_doll_9.jpg": [
        [
            "What color is sks?",
            "sks in the image is pink."
        ],
        [
            "Where is sks in the image?",
            "sks in the image is sitting on a windowsill."
        ],
        [
            "Where is sks positioned in the image?",
            "sks is positioned on the windowsill, sitting next to a blue cup."
        ],
        [
            "Does sks appear to be the main subject of the image?",
            "yes, sks appears to be the main subject of the image, as it is the central figure and is surrounded by other objects that are less prominent. sks is also the most colorful and detailed object in the scene, which draws the viewer's attention."
        ],
        [
            "What objects is sks interacting with in the image?",
            "in the image, sks is interacting with a blue mug and a pen. the mug is placed next to sks, and the pen is inside the mug. sks is also positioned near a window, which suggests that the setting might be an office or a workspace."
        ],
        [
            "How would you describe the texture of sks in the image?",
            "sks in the image appears to have a smooth texture, with a glossy finish that suggests it might be made of a material like plastic or resin. the details on sks, such as the clothing and accessories, are also well-defined, indicating that sks is likely made with precision and attention to detail."
        ],
        [
            "What types of materials is sks be made of?",
            "sks in the image appears to be made of a combination of materials. the head and upper body seem to be made of a plastic or resin material, while the lower body and limbs might be made of a softer, more flexible material like fabric or a similar synthetic material. the clothing and accessories, such as the hat and the pearl necklace, are likely made of fabric or a similar textile material. the overall appearance suggests a blend of materials to create a stylized, decorative figure."
        ],
        [
            "Is sks large or small in the image?",
            "skss in the image are small."
        ],
        [
            "Is sks close to the camera or far away?",
            "sks is close to the camera."
        ]
    ]
}